SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/MGM27/Include/mgm27_pdm.h
/**************************************************************************//**
 * @file
 * @brief MGM27 PDM register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2025 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef MGM27_PDM_H
#define MGM27_PDM_H
#define PDM_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup MGM27_PDM PDM
 * @{
 * @brief MGM27 PDM Register Declaration.
 *****************************************************************************/

/** PDM Register Declaration. */
typedef struct pdm_typedef{
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< PDM Module enable Register                         */
  __IOM uint32_t CTRL;                          /**< PDM Core Control Register                          */
  __IOM uint32_t CMD;                           /**< PDM Core Command Register                          */
  __IM uint32_t  STATUS;                        /**< PDM Status register                                */
  __IOM uint32_t CFG0;                          /**< PDM Core Configuration Register0                   */
  __IOM uint32_t CFG1;                          /**< PDM Core Configuration Register1                   */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  RXDATA;                        /**< PDM Received Data Register                         */
  uint32_t       RESERVED1[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF;                            /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN;                           /**< Interrupt Flag Register                            */
  uint32_t       RESERVED2[6U];                 /**< Reserved for future use                            */
  __IM uint32_t  SYNCBUSY;                      /**< Synchronization Busy Register                      */
  uint32_t       RESERVED3[999U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< PDM Module enable Register                         */
  __IOM uint32_t CTRL_SET;                      /**< PDM Core Control Register                          */
  __IOM uint32_t CMD_SET;                       /**< PDM Core Command Register                          */
  __IM uint32_t  STATUS_SET;                    /**< PDM Status register                                */
  __IOM uint32_t CFG0_SET;                      /**< PDM Core Configuration Register0                   */
  __IOM uint32_t CFG1_SET;                      /**< PDM Core Configuration Register1                   */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  RXDATA_SET;                    /**< PDM Received Data Register                         */
  uint32_t       RESERVED5[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Flag Register                            */
  uint32_t       RESERVED6[6U];                 /**< Reserved for future use                            */
  __IM uint32_t  SYNCBUSY_SET;                  /**< Synchronization Busy Register                      */
  uint32_t       RESERVED7[999U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< PDM Module enable Register                         */
  __IOM uint32_t CTRL_CLR;                      /**< PDM Core Control Register                          */
  __IOM uint32_t CMD_CLR;                       /**< PDM Core Command Register                          */
  __IM uint32_t  STATUS_CLR;                    /**< PDM Status register                                */
  __IOM uint32_t CFG0_CLR;                      /**< PDM Core Configuration Register0                   */
  __IOM uint32_t CFG1_CLR;                      /**< PDM Core Configuration Register1                   */
  uint32_t       RESERVED8[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  RXDATA_CLR;                    /**< PDM Received Data Register                         */
  uint32_t       RESERVED9[7U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Flag Register                            */
  uint32_t       RESERVED10[6U];                /**< Reserved for future use                            */
  __IM uint32_t  SYNCBUSY_CLR;                  /**< Synchronization Busy Register                      */
  uint32_t       RESERVED11[999U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< PDM Module enable Register                         */
  __IOM uint32_t CTRL_TGL;                      /**< PDM Core Control Register                          */
  __IOM uint32_t CMD_TGL;                       /**< PDM Core Command Register                          */
  __IM uint32_t  STATUS_TGL;                    /**< PDM Status register                                */
  __IOM uint32_t CFG0_TGL;                      /**< PDM Core Configuration Register0                   */
  __IOM uint32_t CFG1_TGL;                      /**< PDM Core Configuration Register1                   */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  __IM uint32_t  RXDATA_TGL;                    /**< PDM Received Data Register                         */
  uint32_t       RESERVED13[7U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_TGL;                        /**< Interrupt Flag Register                            */
  __IOM uint32_t IEN_TGL;                       /**< Interrupt Flag Register                            */
  uint32_t       RESERVED14[6U];                /**< Reserved for future use                            */
  __IM uint32_t  SYNCBUSY_TGL;                  /**< Synchronization Busy Register                      */
} PDM_TypeDef;
/** @} End of group MGM27_PDM */

/**************************************************************************//**
 * @addtogroup MGM27_PDM
 * @{
 * @defgroup MGM27_PDM_BitFields PDM Bit Fields
 * @{
 *****************************************************************************/

